For the same template, I got 2 configs that are in success with following logs: 

```hcl 
2024/07/04 06:39:11 Terraform plan | Note: Objects have changed outside of Terraform
 2024/07/04 06:39:11 Terraform plan | 
 2024/07/04 06:39:11 Terraform plan | Terraform detected the following changes made outside of Terraform since the
 2024/07/04 06:39:11 Terraform plan | last "terraform apply" which may have affected this plan:
 2024/07/04 06:39:11 Terraform plan | 
 2024/07/04 06:39:11 Terraform plan |   # module.iz_environment.module.cos.ibm_cos_bucket.cos_bucket[0] has changed
 2024/07/04 06:39:11 Terraform plan |   ~ resource "ibm_cos_bucket" "cos_bucket" {
 2024/07/04 06:39:11 Terraform plan |         id                   = "crn:v1:bluemix:public:cloud-object-storage:global:a/3f2cae45b0644f6d87aefcf404f5987f:85d451f7-57fa-48ae-8f0c-9b166420f246:bucket:env-guardium-cos-bucket:meta:rl:eu-fr2:direct"
 2024/07/04 06:39:11 Terraform plan |       ~ s3_endpoint_public   = "s3.direct.eu-fr2.cloud-object-storage.appdomain.cloud" -> "s3.eu-fr2.cloud-object-storage.appdomain.cloud"
 2024/07/04 06:39:11 Terraform plan |         # (12 unchanged attributes hidden)
 2024/07/04 06:39:11 Terraform plan | 
 2024/07/04 06:39:11 Terraform plan |         # (2 unchanged blocks hidden)
 2024/07/04 06:39:11 Terraform plan |     }
 2024/07/04 06:39:11 Terraform plan | 
 2024/07/04 06:39:11 Terraform plan | 
 2024/07/04 06:39:11 Terraform plan | Unless you have made equivalent changes to your configuration, or ignored the
 2024/07/04 06:39:11 Terraform plan | relevant attributes using ignore_changes, the following plan may include
 2024/07/04 06:39:11 Terraform plan | actions to undo or respond to these changes.
 2024/07/04 06:39:11 Terraform plan | 
 2024/07/04 06:39:11 Terraform plan | ─────────────────────────────────────────────────────────────────────────────
 2024/07/04 06:39:11 Terraform plan | 
 2024/07/04 06:39:11 Terraform plan | Terraform used the selected providers to generate the following execution
 2024/07/04 06:39:11 Terraform plan | plan. Resource actions are indicated with the following symbols:
 2024/07/04 06:39:11 Terraform plan |   ~ update in-place
 2024/07/04 06:39:11 Terraform plan | -/+ destroy and then create replacement
 2024/07/04 06:39:11 Terraform plan |  <= read (data resources)
 2024/07/04 06:39:11 Terraform plan | 
 2024/07/04 06:39:11 Terraform plan | Terraform will perform the following actions:
 2024/07/04 06:39:11 Terraform plan | 
 2024/07/04 06:39:11 Terraform plan |   # module.iz_environment.module.access_groups["project"].ibm_iam_trusted_profile_policy.this["account"] will be updated in-place
 2024/07/04 06:39:11 Terraform plan |   ~ resource "ibm_iam_trusted_profile_policy" "this" {
 2024/07/04 06:39:11 Terraform plan |       ~ account_management = true -> false
 2024/07/04 06:39:11 Terraform plan |         id                 = "Profile-94eaf97d-1f18-4f56-9cff-f18dcf06af3b/47460373-04f4-4c60-af08-0e7694bc0748"
 2024/07/04 06:39:11 Terraform plan |         # (4 unchanged attributes hidden)
 2024/07/04 06:39:11 Terraform plan | 
 2024/07/04 06:39:11 Terraform plan |         # (1 unchanged block hidden)
 2024/07/04 06:39:11 Terraform plan |     }
 2024/07/04 06:39:11 Terraform plan | 
 2024/07/04 06:39:11 Terraform plan |   # module.iz_environment.module.iz_project.data.external.env will be read during apply
 2024/07/04 06:39:11 Terraform plan |   # (depends on a resource or a module with changes pending)
 2024/07/04 06:39:11 Terraform plan |  <= data "external" "env" {
 2024/07/04 06:39:11 Terraform plan |       + id      = (known after apply)
 2024/07/04 06:39:11 Terraform plan |       + program = [
 2024/07/04 06:39:11 Terraform plan |           + ".terraform/modules/iz_environment.iz_project/scripts/extract_env_vars.sh",
 2024/07/04 06:39:11 Terraform plan |         ]
 2024/07/04 06:39:11 Terraform plan |       + result  = (known after apply)
 2024/07/04 06:39:11 Terraform plan |     }
 2024/07/04 06:39:11 Terraform plan | 
 2024/07/04 06:39:11 Terraform plan |   # module.iz_environment.module.iz_project.data.ibm_iam_trusted_profile.trusted_profile[0] will be read during apply
 2024/07/04 06:39:11 Terraform plan |   # (depends on a resource or a module with changes pending)
 2024/07/04 06:39:11 Terraform plan |  <= data "ibm_iam_trusted_profile" "trusted_profile" {
 2024/07/04 06:39:11 Terraform plan |       + account_id     = (known after apply)
 2024/07/04 06:39:11 Terraform plan |       + assignment_id  = (known after apply)
 2024/07/04 06:39:11 Terraform plan |       + created_at     = (known after apply)
 2024/07/04 06:39:11 Terraform plan |       + crn            = (known after apply)
 2024/07/04 06:39:11 Terraform plan |       + description    = (known after apply)
 2024/07/04 06:39:11 Terraform plan |       + entity_tag     = (known after apply)
 2024/07/04 06:39:11 Terraform plan |       + history        = (known after apply)
 2024/07/04 06:39:11 Terraform plan |       + iam_id         = (known after apply)
 2024/07/04 06:39:11 Terraform plan |       + id             = (known after apply)
 2024/07/04 06:39:11 Terraform plan |       + ims_account_id = (known after apply)
 2024/07/04 06:39:11 Terraform plan |       + ims_user_id    = (known after apply)
 2024/07/04 06:39:11 Terraform plan |       + modified_at    = (known after apply)
 2024/07/04 06:39:11 Terraform plan |       + name           = (known after apply)
 2024/07/04 06:39:11 Terraform plan |       + profile_id     = "Profile-94eaf97d-1f18-4f56-9cff-f18dcf06af3b"
 2024/07/04 06:39:11 Terraform plan |       + template_id    = (known after apply)
 2024/07/04 06:39:11 Terraform plan |     }
 2024/07/04 06:39:11 Terraform plan | 
 2024/07/04 06:39:11 Terraform plan |   # module.iz_environment.module.iz_project.ibm_project_environment.this[0] will be updated in-place
 2024/07/04 06:39:11 Terraform plan |   ~ resource "ibm_project_environment" "this" {
 2024/07/04 06:39:11 Terraform plan |         id                     = "cd5ad037-9d86-4c9f-be7a-55a07060258f/bf4c303e-927a-402b-b910-3ed0fbfb7415"
 2024/07/04 06:39:11 Terraform plan |         # (7 unchanged attributes hidden)
 2024/07/04 06:39:11 Terraform plan | 
 2024/07/04 06:39:11 Terraform plan |       ~ definition {
 2024/07/04 06:39:11 Terraform plan |             name        = "env-guardium-project-environment"
 2024/07/04 06:39:11 Terraform plan |             # (2 unchanged attributes hidden)
 2024/07/04 06:39:11 Terraform plan | 
 2024/07/04 06:39:11 Terraform plan |           ~ authorizations {
 2024/07/04 06:39:11 Terraform plan |               ~ trusted_profile_id = "Profile-94eaf97d-1f18-4f56-9cff-f18dcf06af3b" -> (known after apply)
 2024/07/04 06:39:11 Terraform plan |                 # (1 unchanged attribute hidden)
 2024/07/04 06:39:11 Terraform plan |             }
 2024/07/04 06:39:11 Terraform plan |         }
 2024/07/04 06:39:11 Terraform plan |     }
 2024/07/04 06:39:11 Terraform plan | 
 2024/07/04 06:39:11 Terraform plan |   # module.iz_environment.module.iz_project.null_resource.attach_project_crn[0] must be replaced
 2024/07/04 06:39:11 Terraform plan | -/+ resource "null_resource" "attach_project_crn" {
 2024/07/04 06:39:11 Terraform plan |       ~ id       = "3636325891913538248" -> (known after apply)
 2024/07/04 06:39:11 Terraform plan |       ~ triggers = { # forces replacement
 2024/07/04 06:39:11 Terraform plan |           ~ "always_run" = "2024-06-27T14:45:35Z" -> (known after apply)
 2024/07/04 06:39:11 Terraform plan |         }
 2024/07/04 06:39:11 Terraform plan |     }
 2024/07/04 06:39:11 Terraform plan | 
 2024/07/04 06:39:11 Terraform plan | Plan: 1 to add, 2 to change, 1 to destroy.
 2024/07/04 06:39:11 Command finished successfully.
 ```